In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

- Note:  Mapping is a great way to add columns to dataframes

In [2]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],'altitude':[3158,3000,2762]})

dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>altitude</th>
      <th>city</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>3158</td>
      <td>Alma</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3000</td>
      <td>Brian Head</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2762</td>
      <td>Fox Park</td>
    </tr>
  </tbody>
</table>
</div>

In [3]:
# Creating a dictionary called 'state_map'
state_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [4]:
# Syntax to create a new column, called 'state'. We are calling the map() method onto the city column using the 
# state_map dictionary
dframe['state'] = dframe['city'].map(state_map)

In [5]:
dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>altitude</th>
      <th>city</th>
      <th>state</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>3158</td>
      <td>Alma</td>
      <td>Colorado</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3000</td>
      <td>Brian Head</td>
      <td>Utah</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2762</td>
      <td>Fox Park</td>
      <td>Wyoming</td>
    </tr>
  </tbody>
</table>
</div>